Revit 2027 API
StructuralSectionHotRolled.WebThickness Property
 Web Thickness.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WebThickness { get; set; }
Public Property WebThickness As Double
	Get
	Set
public:
property double WebThickness {
	double get ();
	void set (double value);
}
member WebThickness : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionHotRolled Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace